package banner

import "fmt"

const lionArt = `
　　　　 ,、,,,、,,,
　　 _,,;' '" '' ;;,,
　　（rヽ,;''""''゛゛;,ﾉｒ）
　　 ,; i ___　、___iヽ゛;,　　%s
　 ,;'''|ヽ・〉〈・ノ |ﾞ ';,
　 ,;''"|　 　▼　　 |ﾞ゛';,
　 ,;''　ヽ ＿人＿  /　,;'_
 ／ｼ、    ヽ  ⌒⌒  /　 ﾘ　＼
|　　"ｒ,,` + "`" + `"'''ﾞ´　　,,ﾐ|
|　　 　 ﾘ、　　　　,ﾘ　　 |
|　　i 　゛ｒ、ﾉ,,ｒ" i _ |
|　　` + "`" + `ー――-----------┴ ⌒´ ）
（ヽ  _____________ ,, ＿´）
 （_⌒_______________ ,, ィ
     T                 |
     |                 |
`

// Roar はライオンがメッセージ付きで吠える。
func Roar(message string) string {
	return fmt.Sprintf(lionArt, message)
}
